Deep-Learning/MiMo-V2.5-Pro-on-MI300X-Benchmark/data/raw-logs/20260713-amd-tuned-moe-expanded-concurrency/points/decode/benchmark_8192_out1024_con256.log
/opt/venv/lib/python3.10/site-packages/transformers/modeling_rope_utils.py:1034: FutureWarning: `rope_config_validation` is deprecated and has been removed. Its functionality has been moved to RotaryEmbeddingConfigMixin.validate_rope method. PreTrainedConfig inherits this class, so please call self.validate_rope() instead. Also, make sure to use the new rope_parameters syntax. You can call self.standardize_rope_params() in the meantime.
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=256, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=32, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://<ip>:40000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=256, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=32, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 2097152
#Output tokens: 262144
Starting warmup with 32 sequences...
Warmup completed with 32 sequences. Starting main benchmark run...

  0%|          | 0/256 [00:00<?, ?it/s]
  0%|          | 1/256 [00:10<46:31, 10.95s/it]
  1%|          | 2/256 [00:12<22:53,  5.41s/it]
  1%|          | 3/256 [00:14<16:12,  3.84s/it]
  2%|▏         | 6/256 [00:15<06:14,  1.50s/it]
  3%|▎         | 7/256 [00:17<06:35,  1.59s/it]
  4%|▍         | 10/256 [00:18<04:02,  1.01it/s]
  4%|▍         | 11/256 [00:20<04:33,  1.11s/it]
  6%|▌         | 15/256 [00:21<02:42,  1.48it/s]
  6%|▋         | 16/256 [00:22<03:14,  1.24it/s]
  8%|▊         | 20/256 [00:23<01:55,  2.04it/s]
  8%|▊         | 21/256 [00:24<02:28,  1.59it/s]
  9%|▉         | 24/256 [00:25<01:48,  2.14it/s]
 10%|▉         | 25/256 [00:26<02:18,  1.67it/s]
 11%|█         | 27/256 [00:27<02:08,  1.78it/s]
 11%|█▏        | 29/256 [00:28<01:59,  1.90it/s]
 12%|█▏        | 31/256 [00:29<01:52,  2.00it/s]
 13%|█▎        | 33/256 [00:30<01:47,  2.07it/s]
 14%|█▎        | 35/256 [00:31<01:43,  2.13it/s]
 14%|█▍        | 37/256 [00:32<01:41,  2.16it/s]
 15%|█▌        | 39/256 [00:32<01:37,  2.22it/s]
 16%|█▌        | 41/256 [00:33<01:35,  2.26it/s]
 17%|█▋        | 43/256 [00:34<01:33,  2.29it/s]
 18%|█▊        | 46/256 [00:35<01:10,  3.00it/s]
 18%|█▊        | 47/256 [00:36<01:34,  2.20it/s]
 20%|█▉        | 50/256 [00:36<01:10,  2.91it/s]
 20%|█▉        | 51/256 [00:37<01:36,  2.13it/s]
 21%|██        | 54/256 [00:38<01:09,  2.92it/s]
 21%|██▏       | 55/256 [00:39<01:33,  2.16it/s]
 23%|██▎       | 58/256 [00:39<01:07,  2.95it/s]
 23%|██▎       | 59/256 [00:40<01:28,  2.22it/s]
 24%|██▍       | 62/256 [00:41<01:11,  2.70it/s]
 25%|██▍       | 63/256 [00:42<01:32,  2.08it/s]
 27%|██▋       | 68/256 [00:43<00:55,  3.38it/s]
 27%|██▋       | 69/256 [00:44<01:12,  2.58it/s]
 28%|██▊       | 72/256 [00:44<00:54,  3.39it/s]
 29%|██▊       | 73/256 [00:45<01:13,  2.49it/s]
 30%|██▉       | 76/256 [00:46<00:53,  3.34it/s]
 30%|███       | 77/256 [00:47<01:14,  2.40it/s]
 31%|███▏      | 80/256 [00:48<01:00,  2.89it/s]
 32%|███▏      | 81/256 [00:49<01:20,  2.17it/s]
 33%|███▎      | 85/256 [00:49<00:49,  3.43it/s]
 34%|███▎      | 86/256 [00:50<01:08,  2.49it/s]
 35%|███▍      | 89/256 [00:51<00:51,  3.26it/s]
 35%|███▌      | 90/256 [00:51<01:08,  2.43it/s]
 36%|███▋      | 93/256 [00:52<00:49,  3.32it/s]
 37%|███▋      | 94/256 [00:53<01:06,  2.42it/s]
 38%|███▊      | 96/256 [00:54<01:05,  2.45it/s]
 39%|███▉      | 100/256 [00:54<00:45,  3.43it/s]
 39%|███▉      | 101/256 [00:55<00:59,  2.59it/s]
 40%|████      | 103/256 [00:56<00:59,  2.56it/s]
 41%|████▏     | 106/256 [00:57<00:44,  3.36it/s]
 42%|████▏     | 107/256 [00:58<01:01,  2.41it/s]
 43%|████▎     | 110/256 [00:58<00:51,  2.82it/s]
 43%|████▎     | 111/256 [00:59<01:08,  2.12it/s]
 45%|████▌     | 116/256 [01:01<00:47,  2.97it/s]
 46%|████▌     | 117/256 [01:02<01:00,  2.32it/s]
 46%|████▌     | 118/256 [01:03<01:17,  1.78it/s]
 48%|████▊     | 124/256 [01:03<00:35,  3.69it/s]
 49%|████▉     | 126/256 [01:04<00:38,  3.36it/s]
 50%|████▉     | 127/256 [01:05<00:50,  2.55it/s]
 51%|█████     | 130/256 [01:05<00:37,  3.35it/s]
 51%|█████     | 131/256 [01:06<00:50,  2.47it/s]
 52%|█████▏    | 134/256 [01:07<00:37,  3.23it/s]
 53%|█████▎    | 135/256 [01:08<00:50,  2.40it/s]
 54%|█████▍    | 138/256 [01:08<00:37,  3.16it/s]
 54%|█████▍    | 139/256 [01:09<00:50,  2.33it/s]
 55%|█████▌    | 141/256 [01:10<00:53,  2.16it/s]
 57%|█████▋    | 145/256 [01:11<00:34,  3.19it/s]
 57%|█████▋    | 146/256 [01:13<00:59,  1.85it/s]
 60%|█████▉    | 153/256 [01:13<00:26,  3.90it/s]
 60%|██████    | 154/256 [01:14<00:32,  3.15it/s]
 61%|██████    | 156/256 [01:15<00:33,  2.94it/s]
 62%|██████▎   | 160/256 [01:15<00:22,  4.26it/s]
 63%|██████▎   | 161/256 [01:16<00:28,  3.34it/s]
 64%|██████▍   | 164/256 [01:16<00:21,  4.38it/s]
 64%|██████▍   | 165/256 [01:17<00:27,  3.33it/s]
 66%|██████▌   | 169/256 [01:18<00:18,  4.71it/s]
 66%|██████▋   | 170/256 [01:18<00:23,  3.71it/s]
 67%|██████▋   | 172/256 [01:19<00:23,  3.56it/s]
 69%|██████▉   | 176/256 [01:19<00:16,  4.94it/s]
 69%|██████▉   | 177/256 [01:20<00:20,  3.88it/s]
 71%|███████   | 182/256 [01:20<00:11,  6.30it/s]
 71%|███████▏  | 183/256 [05:54<41:27, 34.08s/it]
 73%|███████▎  | 186/256 [05:59<26:37, 22.82s/it]
100%|██████████| 256/256 [05:59<00:00,  1.40s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 256       
Successful requests:                     256       
Benchmark duration (s):                  359.11    
Total input tokens:                      2097152   
Total input text tokens:                 2097152   
Total generated tokens:                  262144    
Total generated tokens (retokenized):    47543     
Request throughput (req/s):              0.71      
Input token throughput (tok/s):          5839.87   
Output token throughput (tok/s):         729.98    
Peak output token throughput (tok/s):    3072.00   
Peak concurrent requests:                256       
Total token throughput (tok/s):          6569.85   
Concurrency:                             99.86     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   140086.00 
Median E2E Latency (ms):                 65389.13  
P90 E2E Latency (ms):                    358939.84 
P95 E2E Latency (ms):                    358955.00 
P99 E2E Latency (ms):                    359011.36 
---------------Time to First Token----------------
Mean TTFT (ms):                          29013.34  
Median TTFT (ms):                        22311.78  
P90 TTFT (ms):                           59736.00  
P95 TTFT (ms):                           64568.73  
P99 TTFT (ms):                           196140.78 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          108.58    
Median TPOT (ms):                        16.79     
P90 TPOT (ms):                           350.87    
P95 TPOT (ms):                           350.88    
P99 TPOT (ms):                           350.94    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           15.67     
Median ITL (ms):                         16.88     
P90 ITL (ms):                            18.04     
P95 ITL (ms):                            18.50     
P99 ITL (ms):                            20.10     
Max ITL (ms):                            95.75     
==================================================